** Setup 
*** Install plugin docker thing 
#+BEGIN_SRC bash
docker exec elasticsearch  /usr/share/elasticsearch/bin/elasticsearch-plugin install \
    pl.allegro.tech.elasticsearch.plugin:elasticsearch-analysis-morfologik:6.6.2

docker restart elasticsearch
docker restart lab2_kibana_1
#+END_SRC

*** Create index
#+BEGIN_SRC bash 
curl -d '{
  "settings": {
    "analysis": {
      "analyzer": {
        "my_custom_analyzer": {
          "type": "custom",
          "tokenizer": "standard",
          "filter": [
            "law_synonyms",
            "morfologik_stem",
            "lowercase"
          ]
        }
      },
      "filter": {
        "law_synonyms": {
          "type": "synonym",
          "synonyms": [
            "kpc  => kodeks postępowania cywilnego",
            "kpk => kodeks postępowania karnego",
            "kk => kodeks karny",
            "kc => kodeks cywilny"
            ]
        }
      }
    }
  },
  "mappings": {
    "_doc": {
      "properties": {
        "title": {
          "type": "text",
          "analyzer": "default",
          "search_analyzer": "default",
          "search_quote_analyzer": "default"
        },
        "content": {
          "type": "text",
          "term_vector": "with_positions_offsets_payloads",
          "analyzer": "my_custom_analyzer",
          "search_analyzer": "my_custom_analyzer",
          "search_quote_analyzer": "my_custom_analyzer"
        }
      }
    }
  }
}' -X PUT http://localhost:9200/law_index6 -H "content-type:application/json"
#+end_src

#+RESULTS:
| acknowledged | shards_acknowledged:true | law_index6 |


* Ex1
/Use ElasticSearch term vectors API to retrieve and store for each document the following data:/
  - /The terms (tokens) that are present in the document./
  - /The number of times given term is present in the document./
